In [4]:
import pandas as pd
import numpy as np
from IPython.display import display

from utils import (
    execute_query,
    create_table_from_df,
    read_sql_file,
    read_json_file
)

# Leer credenciales

In [5]:
# {
#    "host" : "localhost",
#    "dbname" : "dvdrental",
#    "user" : "postgres",
#    "password" : "",
#    "port" : "5432"
# }

credenciales = read_json_file("credentials.json")

In [6]:
for clave, valor in credenciales.items():
    if clave == "password": 
        print(f"{clave}: {'*' * len(valor)}")
    else:
        print(f"{clave}: {valor}")

host: localhost
dbname: dvdrental
user: postgres
password: *********
port: 5432

# Queries

In [7]:
query = """
SELECT 
*
FROM film;
"""

df_resultado = execute_query(query, credenciales)

In [9]:

pd.set_option('display.max_columns', None)
pd.set_option('display.width', 2000)  # Puedes aumentar este n√∫mero si quieres
pd.set_option('display.max_colwidth', None)

df_resultado

     film_id              title                                                                                                        description  release_year  language_id  rental_duration rental_rate  length replacement_cost rating             last_update                             special_features                                                                                                                                                   fulltext
0        133    Chamber Italian                                A Fateful Reflection of a Moose And a Husband who must Overcome a Monkey in Nigeria          2006            1                7        4.99     117            14.99  NC-17 2013-05-26 14:50:58.951                                   [Trailers]                                         'chamber':1 'fate':4 'husband':11 'italian':2 'monkey':16 'moos':8 'must':13 'nigeria':18 'overcom':14 'reflect':5
1        384   Grosse Wonderful                                          A Epic Drama of a Cat And a Explorer who must Redeem a Moose in Australia          2006            1                5        4.99      49            19.99      R 2013-05-26 14:50:58.951                          [Behind the Scenes]                                                 'australia':18 'cat':8 'drama':5 'epic':4 'explor':11 'gross':1 'moos':16 'must':13 'redeem':14 'wonder':2
2          8    Airport Pollock                                      A Epic Tale of a Moose And a Girl who must Confront a Monkey in Ancient India          2006            1                6        4.99      54            15.99      R 2013-05-26 14:50:58.951                                   [Trailers]                                   'airport':1 'ancient':18 'confront':14 'epic':4 'girl':11 'india':19 'monkey':16 'moos':8 'must':13 'pollock':2 'tale':5
3         98  Bright Encounters                             A Fateful Yarn of a Lumberjack And a Feminist who must Conquer a Student in A Jet Boat          2006            1                4        4.99      73            12.99  PG-13 2013-05-26 14:50:58.951                                   [Trailers]                               'boat':20 'bright':1 'conquer':14 'encount':2 'fate':4 'feminist':11 'jet':19 'lumberjack':8 'must':13 'student':16 'yarn':5
4          1   Academy Dinosaur                   A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies          2006            1                6        0.99      86            20.99     PG 2013-05-26 14:50:58.951          [Deleted Scenes, Behind the Scenes]                'academi':1 'battl':15 'canadian':20 'dinosaur':2 'drama':5 'epic':4 'feminist':8 'mad':11 'must':14 'rocki':21 'scientist':12 'teacher':17
..       ...                ...                                                                                                                ...           ...          ...              ...         ...     ...              ...    ...                     ...                                          ...                                                                                                                                                        ...
995      996     Young Language  A Unbelieveable Yarn of a Boat And a Database Administrator who must Meet a Boy in The First Manned Space Station          2006            1                6        0.99     183             9.99      G 2013-05-26 14:50:58.951                [Trailers, Behind the Scenes]  'administr':12 'boat':8 'boy':17 'databas':11 'first':20 'languag':2 'man':21 'meet':15 'must':14 'space':22 'station':23 'unbeliev':4 'yarn':5 'young':1
996      997         Youth Kick                          A Touching Drama of a Teacher And a Cat who must Challenge a Technical Writer in A U-Boat          2006            1                4        0.99     179            14.99  NC-17 2013-05-26 14:50:58.951                [Trailers, Behind the Scenes]                  'boat':22 'cat':11 'challeng':14 'drama':5 'kick':2 'must':13 'teacher':8 'technic':16 'touch':4 'u':21 'u-boat':20 'writer':17 'youth':1
997      998       Zhivago Core                                 A Fateful Yarn of a Composer And a Man who must Face a Boy in The Canadian Rockies          2006            1                6        0.99     105            10.99  NC-17 2013-05-26 14:50:58.951                             [Deleted Scenes]                                           'boy':16 'canadian':19 'compos':8 'core':2 'face':14 'fate':4 'man':11 'must':13 'rocki':20 'yarn':5 'zhivago':1
998      999  Zoolander Fiction                   A Fateful Reflection of a Waitress And a Boat who must Discover a Sumo Wrestler in Ancient China          2006            1                5        2.99     101            28.99      R 2013-05-26 14:50:58.951                   [Trailers, Deleted Scenes]                  'ancient':19 'boat':11 'china':20 'discov':14 'fate':4 'fiction':2 'must':13 'reflect':5 'sumo':16 'waitress':8 'wrestler':17 'zooland':1
999     1000          Zorro Ark                              A Intrepid Panorama of a Mad Scientist And a Boy who must Redeem a Boy in A Monastery          2006            1                3        4.99      50            18.99  NC-17 2013-05-26 14:50:58.951  [Trailers, Commentaries, Behind the Scenes]                                         'ark':2 'boy':12,17 'intrepid':4 'mad':8 'monasteri':20 'must':14 'panorama':5 'redeem':15 'scientist':9 'zorro':1

[1000 rows x 13 columns]

In [10]:
sql_query = read_sql_file("queries/ejemplo1.sql")
df_resultado_2 = execute_query(sql_query, credenciales)

In [11]:
df_resultado_2.head(20)

    film_id              title
0       133    Chamber Italian
1       384   Grosse Wonderful
2         8    Airport Pollock
3        98  Bright Encounters
4         1   Academy Dinosaur
5         2     Ace Goldfinger
6         3   Adaptation Holes
7         4   Affair Prejudice
8         5        African Egg
9         6       Agent Truman
10        7    Airplane Sierra
11        9      Alabama Devil
12       10   Aladdin Calendar
13       11    Alamo Videotape
14       12     Alaska Phantom
15      213         Date Speed
16       13        Ali Forever
17       14     Alice Fantasia
18       15       Alien Center
19       16    Alley Evolution

# Crear tablas

## Generar datos de prueba

In [12]:
# Generar 100 filas de datos
np.random.seed(42)  # Fijar semilla para reproducibilidad

num_rows = 100

data = {
    "sale_id": np.arange(1, num_rows + 1),  # IDs de 1 a 100
    "customer_id": np.random.randint(100, 110, size=num_rows),  # 10 clientes (100-109)
    "category": np.random.choice(["Electronics", "Clothes", "Books", "Home", "Beauty", "Food"], size=num_rows),
    "amount": np.random.randint(10, 1000, size=num_rows),  # Montos entre 10 y 1000
    "sale_date": pd.date_range(start="2024-01-01", periods=num_rows, freq="D")  # Fechas consecutivas
}

test_data = pd.DataFrame(data)

# Mostrar primeras filas
test_data.head(10)

display(test_data.head())

   sale_id  customer_id     category  amount  sale_date
0        1          106         Home     229 2024-01-01
1        2          103      Clothes     575 2024-01-02
2        3          107  Electronics     864 2024-01-03
3        4          104         Food     745 2024-01-04
4        5          106       Beauty     234 2024-01-05

In [13]:
create_table_from_df(test_data,'datos_transaccionales',credenciales)

Tabla 'datos_transaccionales' creada exitosamente en PostgreSQL.

In [26]:
execute_query('SELECT * FROM datos_transaccionales;', credenciales)

    sale_id  customer_id     category  amount            sale_date
0         1          106         Home     229  2024-01-01 00:00:00
1         2          103      Clothes     575  2024-01-02 00:00:00
2         3          107  Electronics     864  2024-01-03 00:00:00
3         4          104         Food     745  2024-01-04 00:00:00
4         5          106       Beauty     234  2024-01-05 00:00:00
..      ...          ...          ...     ...                  ...
95       96          109  Electronics     413  2024-04-05 00:00:00
96       97          108        Books     161  2024-04-06 00:00:00
97       98          106  Electronics      63  2024-04-07 00:00:00
98       99          108      Clothes     129  2024-04-08 00:00:00
99      100          107      Clothes     682  2024-04-09 00:00:00

[100 rows x 5 columns]

In [ ]:
(
    test_data
    .sort_values('sale_date')
    [['sale_date','amount']]
    .head()
)

    sale_date  amount
90 2024-03-31     108
91 2024-04-01     668
92 2024-04-02     825
93 2024-04-03     217
94 2024-04-04     140
95 2024-04-05     413
96 2024-04-06     161
97 2024-04-07      63
98 2024-04-08     129
99 2024-04-09     682

In [18]:
(
    test_data
    .sort_values('sale_date')
    ['amount']
    .rolling(2,1)
    .mean()
    .head()
)

0    229.0
1    402.0
2    719.5
3    804.5
4    489.5
Name: amount, dtype: float64

In [19]:
test_data.groupby(['category'])['amount'].mean().shape

(6,)

# Ejercicios

1. Numerar las ventas de cada cliente.

üìå Enunciado:
Queremos asignar un n√∫mero de fila a cada venta de un cliente en orden cronol√≥gico. Usa ROW_NUMBER() para numerar cada venta de un cliente, orden√°ndolas por fecha de venta.

In [34]:
query = """
SELECT 
    *,
    ROW_NUMBER() OVER( PARTITION BY customer_id ORDER BY sale_date) as orden
FROM datos_transaccionales;
"""

ejercicio_1 = execute_query(query, credenciales)
ejercicio_1

    sale_id  customer_id     category  amount            sale_date  orden
0        22          100      Clothes     410  2024-01-22 00:00:00      1
1        26          100        Books     846  2024-01-26 00:00:00      2
2        52          100         Home     157  2024-02-21 00:00:00      3
3        79          100         Home     581  2024-03-19 00:00:00      4
4        84          100  Electronics     263  2024-03-24 00:00:00      5
..      ...          ...          ...     ...                  ...    ...
95       64          109        Books     788  2024-03-04 00:00:00      7
96       66          109  Electronics     962  2024-03-06 00:00:00      8
97       76          109  Electronics     153  2024-03-16 00:00:00      9
98       94          109       Beauty     217  2024-04-03 00:00:00     10
99       96          109  Electronics     413  2024-04-05 00:00:00     11

[100 rows x 6 columns]

In [40]:
(
    ejercicio_1
    .query('customer_id == 100')
    .sort_values('sale_date')
)

ejercicio_1.query('customer_id == 109').sort_values('sale_date')

    sale_id  customer_id     category  amount            sale_date  orden
89        6          109        Books     394  2024-01-06 00:00:00      1
90       23          109      Clothes     776  2024-01-23 00:00:00      2
91       27          109  Electronics     893  2024-01-27 00:00:00      3
92       43          109      Clothes     669  2024-02-12 00:00:00      4
93       45          109         Food     964  2024-02-14 00:00:00      5
94       60          109         Food     560  2024-02-29 00:00:00      6
95       64          109        Books     788  2024-03-04 00:00:00      7
96       66          109  Electronics     962  2024-03-06 00:00:00      8
97       76          109  Electronics     153  2024-03-16 00:00:00      9
98       94          109       Beauty     217  2024-04-03 00:00:00     10
99       96          109  Electronics     413  2024-04-05 00:00:00     11

In [41]:
query = """
SELECT 
    customer_id,
    sale_date,
    amount,
    ROW_NUMBER() OVER (PARTITION BY customer_id ORDER BY sale_date) as orden
FROM datos_transaccionales;
"""
ejercicio_1 = execute_query(query, credenciales)

In [42]:
(
    ejercicio_1
    .query('customer_id == 106')
    .sort_values('sale_date')
)

    customer_id            sale_date  amount  orden
51          106  2024-01-01 00:00:00     229      1
52          106  2024-01-05 00:00:00     234      2
53          106  2024-01-08 00:00:00     647      3
54          106  2024-01-29 00:00:00     207      4
55          106  2024-02-04 00:00:00     618      5
56          106  2024-02-07 00:00:00     196      6
57          106  2024-02-18 00:00:00     972      7
58          106  2024-03-09 00:00:00     160      8
59          106  2024-03-21 00:00:00      11      9
60          106  2024-04-04 00:00:00     140     10
61          106  2024-04-07 00:00:00      63     11

2. Calcular el ranking de ventas por categor√≠a.

üìå Enunciado:
Determina el ranking de ventas dentro de cada categor√≠a, ordenando por monto de venta en orden descendente. Usa RANK() para asignar el puesto de cada venta dentro de su categor√≠a.

In [49]:
query = """
SELECT 
    category,
    sale_date,
    amount,
    RANK() OVER (PARTITION BY category ORDER BY amount DESC)
FROM datos_transaccionales;
"""
ejercicio_2 = execute_query(query, credenciales)

ejercicio_2.sample(10)

       category            sale_date  amount  rank
96         Home  2024-03-28 00:00:00     169    15
11       Beauty  2024-04-03 00:00:00     217    12
54  Electronics  2024-03-13 00:00:00     620    11
51  Electronics  2024-01-11 00:00:00     693     8
41      Clothes  2024-04-08 00:00:00     129    10
15        Books  2024-01-26 00:00:00     846     2
38      Clothes  2024-01-02 00:00:00     575     7
62  Electronics  2024-04-04 00:00:00     140    19
12       Beauty  2024-01-29 00:00:00     207    13
52  Electronics  2024-03-03 00:00:00     650     9

In [66]:
(
    ejercicio_2
    .query('category == "Clothes"')
    .sort_values('amount', ascending=False)
)

category_ranks = ejercicio_2.groupby('category')['amount'].sum()
category_ranks = category_ranks.reset_index().sort_values('amount', ascending=False)
category_ranks.reset_index(drop=True, inplace=True)

category_ranks['rank'] = category_ranks['amount'].rank(method='dense', ascending=False).astype(int)

display(category_ranks)
ejercicio_2.query('category == "Clothes"').sort_values('amount', ascending=False)

      category  amount  rank
0  Electronics   11273     1
1         Food   10322     2
2         Home    8308     3
3        Books    7573     4
4       Beauty    7418     5
5      Clothes    6194     6

   category            sale_date  amount  rank
32  Clothes  2024-02-26 00:00:00     938     1
33  Clothes  2024-02-11 00:00:00     780     2
34  Clothes  2024-01-23 00:00:00     776     3
35  Clothes  2024-04-09 00:00:00     682     4
36  Clothes  2024-02-12 00:00:00     669     5
37  Clothes  2024-03-18 00:00:00     633     6
38  Clothes  2024-01-02 00:00:00     575     7
39  Clothes  2024-01-18 00:00:00     448     8
40  Clothes  2024-01-22 00:00:00     410     9
41  Clothes  2024-04-08 00:00:00     129    10
42  Clothes  2024-03-31 00:00:00     108    11
43  Clothes  2024-03-27 00:00:00      46    12

3.  Comparar el monto de cada venta con la anterior.

üìå Enunciado:
Para cada venta, queremos ver cu√°nto vendi√≥ un cliente en su venta anterior. Usa LAG() para obtener el monto de la venta anterior de cada cliente.

In [68]:
(
    ejercicio_1
    .query('customer_id == 100')
    .sort_values('sale_date')
)

   customer_id            sale_date  amount  orden
0          100  2024-01-22 00:00:00     410      1
1          100  2024-01-26 00:00:00     846      2
2          100  2024-02-21 00:00:00     157      3
3          100  2024-03-19 00:00:00     581      4
4          100  2024-03-24 00:00:00     263      5
5          100  2024-03-28 00:00:00     169      6
6          100  2024-04-01 00:00:00     668      7

In [78]:
query = """
SELECT 
    *,
    LAG(amount) OVER (PARTITION BY customer_id ORDER BY sale_date) as monto_anterior,
    LAG(sale_date) OVER (PARTITION BY customer_id ORDER BY sale_date) as fecha_anterior
FROM
    datos_transaccionales
"""

ejercicio_3 = execute_query(query, credenciales)
ejercicio_3

    sale_id  customer_id     category  amount            sale_date  monto_anterior       fecha_anterior
0        22          100      Clothes     410  2024-01-22 00:00:00             NaN                 None
1        26          100        Books     846  2024-01-26 00:00:00           410.0  2024-01-22 00:00:00
2        52          100         Home     157  2024-02-21 00:00:00           846.0  2024-01-26 00:00:00
3        79          100         Home     581  2024-03-19 00:00:00           157.0  2024-02-21 00:00:00
4        84          100  Electronics     263  2024-03-24 00:00:00           581.0  2024-03-19 00:00:00
..      ...          ...          ...     ...                  ...             ...                  ...
95       64          109        Books     788  2024-03-04 00:00:00           560.0  2024-02-29 00:00:00
96       66          109  Electronics     962  2024-03-06 00:00:00           788.0  2024-03-04 00:00:00
97       76          109  Electronics     153  2024-03-16 00:00:00           962.0  2024-03-06 00:00:00
98       94          109       Beauty     217  2024-04-03 00:00:00           153.0  2024-03-16 00:00:00
99       96          109  Electronics     413  2024-04-05 00:00:00           217.0  2024-04-03 00:00:00

[100 rows x 7 columns]

In [79]:
query = """
SELECT 
    *,
    avg(amount) OVER (PARTITION BY customer_id ORDER BY SALE_DATE ROWS BETWEEN 2 PRECEDING AND 1 FOLLOWING) as monto_anterior,
    LAG(sale_date) OVER (PARTITION BY customer_id ORDER BY sale_date) as fecha_anterior
FROM datos_transaccionales;
"""
ejercicio_3 = execute_query(query, credenciales)
ejercicio_3

    sale_id  customer_id     category  amount            sale_date        monto_anterior       fecha_anterior
0        22          100      Clothes     410  2024-01-22 00:00:00  628.0000000000000000                 None
1        26          100        Books     846  2024-01-26 00:00:00  471.0000000000000000  2024-01-22 00:00:00
2        52          100         Home     157  2024-02-21 00:00:00  498.5000000000000000  2024-01-26 00:00:00
3        79          100         Home     581  2024-03-19 00:00:00  461.7500000000000000  2024-02-21 00:00:00
4        84          100  Electronics     263  2024-03-24 00:00:00  292.5000000000000000  2024-03-19 00:00:00
..      ...          ...          ...     ...                  ...                   ...                  ...
95       64          109        Books     788  2024-03-04 00:00:00  818.5000000000000000  2024-02-29 00:00:00
96       66          109  Electronics     962  2024-03-06 00:00:00  615.7500000000000000  2024-03-04 00:00:00
97       76          109  Electronics     153  2024-03-16 00:00:00  530.0000000000000000  2024-03-06 00:00:00
98       94          109       Beauty     217  2024-04-03 00:00:00  436.2500000000000000  2024-03-16 00:00:00
99       96          109  Electronics     413  2024-04-05 00:00:00  261.0000000000000000  2024-04-03 00:00:00

[100 rows x 7 columns]

In [81]:
ejercicio_3.query('customer_id == 100')

   sale_id  customer_id     category  amount            sale_date        monto_anterior       fecha_anterior
0       22          100      Clothes     410  2024-01-22 00:00:00  628.0000000000000000                 None
1       26          100        Books     846  2024-01-26 00:00:00  471.0000000000000000  2024-01-22 00:00:00
2       52          100         Home     157  2024-02-21 00:00:00  498.5000000000000000  2024-01-26 00:00:00
3       79          100         Home     581  2024-03-19 00:00:00  461.7500000000000000  2024-02-21 00:00:00
4       84          100  Electronics     263  2024-03-24 00:00:00  292.5000000000000000  2024-03-19 00:00:00
5       88          100         Home     169  2024-03-28 00:00:00  420.2500000000000000  2024-03-24 00:00:00
6       92          100        Books     668  2024-04-01 00:00:00  366.6666666666666667  2024-03-28 00:00:00

4. Calcular la suma acumulada de ventas por cliente

üìå Enunciado:
Queremos calcular la suma acumulada del monto de ventas por cliente en orden cronol√≥gico. Usa SUM() con OVER() para obtener el total acumulado de cada cliente.

In [84]:
query_4 = """
SELECT 
    *,
    SUM(amount) OVER (PARTITION BY customer_id ORDER BY sale_date) as client_sum
FROM
    datos_transaccionales
;
"""
ejercicio_4 = execute_query(query_4, credenciales)
ejercicio_4

    sale_id  customer_id     category  amount            sale_date  client_sum
0        22          100      Clothes     410  2024-01-22 00:00:00         410
1        26          100        Books     846  2024-01-26 00:00:00        1256
2        52          100         Home     157  2024-02-21 00:00:00        1413
3        79          100         Home     581  2024-03-19 00:00:00        1994
4        84          100  Electronics     263  2024-03-24 00:00:00        2257
..      ...          ...          ...     ...                  ...         ...
95       64          109        Books     788  2024-03-04 00:00:00        5044
96       66          109  Electronics     962  2024-03-06 00:00:00        6006
97       76          109  Electronics     153  2024-03-16 00:00:00        6159
98       94          109       Beauty     217  2024-04-03 00:00:00        6376
99       96          109  Electronics     413  2024-04-05 00:00:00        6789

[100 rows x 6 columns]

In [88]:
ejercicio_4.query('customer_id == 100')

   sale_id  customer_id     category  amount            sale_date  client_sum
0       22          100      Clothes     410  2024-01-22 00:00:00         410
1       26          100        Books     846  2024-01-26 00:00:00        1256
2       52          100         Home     157  2024-02-21 00:00:00        1413
3       79          100         Home     581  2024-03-19 00:00:00        1994
4       84          100  Electronics     263  2024-03-24 00:00:00        2257
5       88          100         Home     169  2024-03-28 00:00:00        2426
6       92          100        Books     668  2024-04-01 00:00:00        3094

5. Obtener el promedio m√≥vil de ventas por categor√≠a

üìå Enunciado:
Calcula el promedio m√≥vil de las √∫ltimas 3 ventas dentro de cada categor√≠a. Usa AVG() con ROWS BETWEEN 2 PRECEDING AND CURRENT ROW para calcularlo.

In [87]:
test_data.head()

   sale_id  customer_id     category  amount  sale_date
0        1          106         Home     229 2024-01-01
1        2          103      Clothes     575 2024-01-02
2        3          107  Electronics     864 2024-01-03
3        4          104         Food     745 2024-01-04
4        5          106       Beauty     234 2024-01-05

In [102]:
query = """
SELECT 
    category,
    ROUND(AVG(amount) OVER (PARTITION BY category ORDER BY sale_date ROWS BETWEEN 2 PRECEDING AND CURRENT ROW), 2) as avg_category
FROM datos_transaccionales;
"""
ejercicio_5 = execute_query(query, credenciales)

In [103]:
ejercicio_5.query('category == "Clothes"')

   category avg_category
32  Clothes       575.00
33  Clothes       511.50
34  Clothes       477.67
35  Clothes       544.67
36  Clothes       655.33
37  Clothes       741.67
38  Clothes       795.67
39  Clothes       746.67
40  Clothes       539.00
41  Clothes       262.33
42  Clothes        94.33
43  Clothes       306.33

# Respuestas

1. 

```sql

SELECT 
    customer_id, 
    sale_id, 
    amount, 
    sale_date,
    ROW_NUMBER() OVER (PARTITION BY customer_id ORDER BY sale_date) AS sale_number
FROM sales;

```

2. 

```sql

SELECT 
    category, 
    sale_id, 
    amount, 
    RANK() OVER (PARTITION BY category ORDER BY amount DESC) AS sale_rank
FROM sales;

```

3. 

```sql

SELECT 
    customer_id, 
    sale_id, 
    amount, 
    sale_date,
    LAG(amount) OVER (PARTITION BY customer_id ORDER BY sale_date) AS previous_sale
FROM sales;


```

4. 

```sql

SELECT 
    customer_id, 
    sale_id, 
    amount, 
    sale_date,
    SUM(amount) OVER (PARTITION BY customer_id ORDER BY sale_date) AS cumulative_sales
FROM sales;

```

5. 

```sql

SELECT 
    category, 
    sale_id, 
    amount, 
    sale_date,
    AVG(amount) OVER (PARTITION BY category ORDER BY sale_date ROWS BETWEEN 2 PRECEDING AND CURRENT ROW) AS moving_avg
FROM sales;


```